# ReloadLatestFinished Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentReloadLatestProgressChangedEventArgs..::..ReloadLatestFinished Property
DocumentReloadLatestProgressChangedEventArgs Class See Also
---
Indicates if current 'reload latest' progress is finished.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public bool ReloadLatestFinished { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ReloadLatestFinished As Boolean
	Get
```

Visual C++
---
```text
public:
property bool ReloadLatestFinished {
	bool get ();
}
```

# See Also
DocumentReloadLatestProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace